In [1]:
#IMPORTING NECESSARY LIBRARIES

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# LOADING AND READING THE EXCEL SHEETS

transaction_data = pd.read_excel("D:\\Work Datasets\\Transactions(data_1).xlsx")

In [3]:
# GETTING A GLIMPSE OF OUR TRANSACTION DATA
transaction_data.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [4]:
# TAKING A SUPERFICIAL OVERVIEW OF THE DATA (such as Datatypes, non-null values,etc. )
transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [5]:
# OBTAINING A SUMMARY STATISTICS ABOUT THE DATA
transaction_data.describe()

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,19640.000000,20000.000000,19803.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,0.500458,1107.829449,556.046951,38199.776549
std,5773.647028,30.75359,1011.951046,0.500013,582.825242,405.955660,2875.201110
min,1.000000,0.00000,1.000000,0.000000,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,0.000000,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,1.000000,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,1.000000,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,1.000000,2091.470000,1759.850000,42710.000000

In [6]:
# TOTAL SIZE OF DATA
transaction_data.shape

(20000, 13)

In [7]:
# CHECKING WHETHER THERE ARE ANY NULL VALUES IN THE DATA
transaction_data.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

## 7 Columns present with missing values that need to be treated...

In [8]:
# CHECKING WHETHER THERE ARE ANY DUPLICATE VALUES 
# CHECKING FOR UNIQUENESS IN DATA
transaction_data.duplicated().sum()

0

# There are no duplicate values

In [9]:
# GETTING AN INSIGHT ON NUMBER OF UNIQUE VALUES IN EVERY COLUMN
transaction_data.nunique()

transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

In [10]:
transaction_data['online_order'].value_counts()

1.0    9829
0.0    9811
Name: online_order, dtype: int64

In [11]:
# FILLING THE MISSING VALUES USING BACKWARD FILL METHOD
transaction_data['online_order']= transaction_data['online_order'].fillna(method='bfill')

In [12]:
transaction_data['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [13]:
cancelled_orders = transaction_data[transaction_data['order_status'] == 'Cancelled'].index
cancelled_orders

Int64Index([   42,   138,   249,   254,   583,   752,   794,   857,   878,
              892,
            ...
            18614, 18752, 18904, 18941, 19272, 19405, 19409, 19822, 19957,
            19989],
           dtype='int64', length=179)

# These cancelled orders need to be filtered out...

In [14]:
transaction_data.drop(cancelled_orders,inplace = True)

In [15]:
transaction_data['brand'].value_counts()

Solex             4211
Giant Bicycles    3283
WeareA2B          3265
OHM Cycles        3016
Trek Bicycles     2965
Norco Bicycles    2885
Name: brand, dtype: int64

In [16]:
transaction_data['brand']= transaction_data['brand'].fillna(method='ffill')

In [17]:
transaction_data['product_line'].value_counts()

Standard    14048
Road         3932
Touring      1225
Mountain      420
Name: product_line, dtype: int64

In [18]:
transaction_data['product_line']= transaction_data['product_line'].fillna(method='ffill')

In [19]:
transaction_data['product_class'].value_counts()

medium    13701
high       2978
low        2946
Name: product_class, dtype: int64

In [20]:
transaction_data['product_class']= transaction_data['product_class'].fillna(method='bfill')

In [21]:
transaction_data['product_size'].value_counts()

medium    12876
large      3938
small      2811
Name: product_size, dtype: int64

In [22]:
transaction_data['product_size']= transaction_data['product_size'].fillna(method='bfill')

In [23]:
transaction_data['standard_cost'].value_counts()

388.920000    461
954.820000    394
53.620000     273
161.600000    232
260.140000    231
             ...
151.960000    124
206.350000    114
312.735016      1
270.299988      1
667.400024      1
Name: standard_cost, Length: 103, dtype: int64

In [24]:
pd.options.display.float_format = '{:,.2f}'.format
mean = transaction_data.groupby(['customer_id']).mean().round(decimals=2)
mean

C:\Users\anann\AppData\Local\Temp\ipykernel_15388\111550582.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  mean = transaction_data.groupby(['customer_id']).mean().round(decimals=2)

,transaction_id,product_id,online_order,list_price,standard_cost,product_first_sold_date
customer_id,,,,,,
1,"11,485.64",34.18,0.55,825.86,551.49,"37,314.09"
2,"8,471.67",37.33,0.33,"1,383.02",640.94,"38,775.67"
3,"13,842.62",60.38,0.25,"1,236.03",815.68,"39,350.25"
4,"13,544.50",78.50,0.50,523.86,413.58,"36,008.50"
5,"7,969.67",48.17,0.33,983.87,584.71,"37,361.00"
...,...,...,...,...,...,...
3497,"8,565.00",32.33,0.67,"1,248.02",698.58,"38,680.33"
3498,"9,327.50",72.17,0.83,862.84,338.29,"37,723.67"
3499,"6,871.29",42.71,0.57,"1,096.21",388.32,"38,163.86"
3500,"10,076.00",40.00,0.33,820.40,522.76,"36,432.50"
5034,"14,292.67",0.00,0.00,506.64,416.81,"37,254.67"

In [25]:
transaction_data['standard_cost']= transaction_data['standard_cost'].fillna(mean.standard_cost)

In [26]:
transaction_data['product_first_sold_date'].value_counts()

33,879.00    232
41,064.00    228
37,823.00    225
39,880.00    220
38,482.00    218
            ...
41,848.00    167
42,404.00    167
41,922.00    164
37,659.00    162
34,586.00    160
Name: product_first_sold_date, Length: 100, dtype: int64

# We need to convert the values of the date column from integers to date

In [27]:
transaction_data['product_first_sold_date'].head()

0   41,245.00
1   41,701.00
2   36,361.00
3   36,145.00
4   42,226.00
Name: product_first_sold_date, dtype: float64

In [28]:
transaction_data['product_first_sold_date'] = pd.to_datetime(transaction_data['product_first_sold_date'], unit='s')
transaction_data['product_first_sold_date'].head()

0   1970-01-01 11:27:25
1   1970-01-01 11:35:01
2   1970-01-01 10:06:01
3   1970-01-01 10:02:25
4   1970-01-01 11:43:46
Name: product_first_sold_date, dtype: datetime64[ns]

In [29]:
transaction_data['product_first_sold_date'].head(20)

0    1970-01-01 11:27:25
1    1970-01-01 11:35:01
2    1970-01-01 10:06:01
3    1970-01-01 10:02:25
4    1970-01-01 11:43:46
5    1970-01-01 10:50:31
6    1970-01-01 09:29:25
7    1970-01-01 11:05:15
8    1970-01-01 09:17:35
9    1970-01-01 10:36:56
10   1970-01-01 11:19:44
11   1970-01-01 11:42:52
12   1970-01-01 09:35:27
13   1970-01-01 09:36:26
14   1970-01-01 10:36:33
15   1970-01-01 10:31:13
16   1970-01-01 10:36:46
17   1970-01-01 09:24:48
18   1970-01-01 11:05:15
19   1970-01-01 10:22:17
Name: product_first_sold_date, dtype: datetime64[ns]

In [30]:
transaction_data['product_first_sold_date'].tail(10)

19990   1970-01-01 11:43:38
19991   1970-01-01 10:54:58
19992   1970-01-01 11:04:40
19993   1970-01-01 11:15:53
19994   1970-01-01 10:36:56
19995   1970-01-01 10:30:23
19996   1970-01-01 09:52:40
19997   1970-01-01 11:13:30
19998   1970-01-01 10:36:56
19999   1970-01-01 10:05:34
Name: product_first_sold_date, dtype: datetime64[ns]

In [31]:
# FILLING THE MISSING DATES WITH A RANDOME DATE PRESENT IN DATA
transaction_data['product_first_sold_date'].fillna(lambda x: np.random.choice(transaction_data['product_first_sold_date']), inplace=True)

In [32]:
# CONVERTING ALL THE COLUMN NAMES TO A CORRECT FORMAT
transaction_data.columns = map(str.lower, transaction_data.columns)
transaction_data.columns = map(str.strip, transaction_data.columns)

In [33]:
transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19821 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           19821 non-null  int64
 1   product_id               19821 non-null  int64
 2   customer_id              19821 non-null  int64
 3   transaction_date         19821 non-null  datetime64[ns]
 4   online_order             19821 non-null  float64
 5   order_status             19821 non-null  object
 6   brand                    19821 non-null  object
 7   product_line             19821 non-null  object
 8   product_class            19821 non-null  object
 9   product_size             19821 non-null  object
 10  list_price               19821 non-null  float64
 11  standard_cost            19645 non-null  float64
 12  product_first_sold_date  19821 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(3), object(6)
memory usage: 2.1+ MB

# There is some issue in the column 'Product_first_sold_date' as it consists of just one date '01-01-1970'

## Here we conclude that in the transactions data, we had :
## 1. 7 columns with missing values that we mitigated
## 2. The datetime format for ' product_first_sold_date' was not proper, so,           I changed it.

In [34]:
# SAVING THIS CLEANED DATAFRAME TO A CSV FORMAT
transaction_data.to_csv('D:\Work Datasets\cleaned_data_1.csv',index=False)